---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsCurveHorOffsetParam
source: html/fddb179b-83be-7bff-ed2f-2edf7803a724.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsCurveHorOffsetParam Property

"Horizontal Justification"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsCurveHorOffsetParam { get; }
```